In [52]:
import psycopg2

try:
    conn = psycopg2.connect(
        host="pg.analytics.northwestern.edu",
        database="everything2023",
        user="",
        password="."  # It's good practice to mask or securely manage passwords and not hard-code them
    )

    # Perform database operations here...

except Exception as e:
    print(f"An error occurred: {e}")

In [53]:
cursor = conn.cursor()
sql_query = "SELECT * FROM group_1.strinfo;"
cursor.execute(sql_query)

In [54]:
import pandas as pd

In [55]:
# the final dataframe from sqlite
data = pd.DataFrame(cursor.fetchall())

In [56]:
data

        0                     1   2      3  4
0       3  ST. LOUIS             MO  63126  0
1       4  LITTLE ROCK           AR  72201  0
2       7  FORT WORTH            TX  76137  0
3       9  TEMPE                 AZ  85281  0
4      60  ASPEN                 CO  81611  0
..    ...                   ...  ..    ... ..
447  9808  GILBERT               AZ  85233  0
448  9812  METAIRIE              LA  70006  0
449  9900  LITTLE ROCK           AR  72201  0
450  9906  LITTLE ROCK           AR  72201  0
451  9909  CHEYENNE              WY  82009  1

[452 rows x 5 columns]

In [57]:
data.columns = ['store', 'city', 'state', 'zip', 'x']
data

     store                  city state    zip  x
0        3  ST. LOUIS               MO  63126  0
1        4  LITTLE ROCK             AR  72201  0
2        7  FORT WORTH              TX  76137  0
3        9  TEMPE                   AZ  85281  0
4       60  ASPEN                   CO  81611  0
..     ...                   ...   ...    ... ..
447   9808  GILBERT                 AZ  85233  0
448   9812  METAIRIE                LA  70006  0
449   9900  LITTLE ROCK             AR  72201  0
450   9906  LITTLE ROCK             AR  72201  0
451   9909  CHEYENNE                WY  82009  1

[452 rows x 5 columns]

In [58]:
import numpy as np

In [65]:
# drop unknown column
data = data[['store', 'city', 'state', 'zip']]

In [66]:
data

     store                  city state    zip
0        3  ST. LOUIS               MO  63126
1        4  LITTLE ROCK             AR  72201
2        7  FORT WORTH              TX  76137
3        9  TEMPE                   AZ  85281
4       60  ASPEN                   CO  81611
..     ...                   ...   ...    ...
447   9808  GILBERT                 AZ  85233
448   9812  METAIRIE                LA  70006
449   9900  LITTLE ROCK             AR  72201
450   9906  LITTLE ROCK             AR  72201
451   9909  CHEYENNE                WY  82009

[452 rows x 4 columns]

In [67]:
# how many unique city there is?
data['city'].nunique()

298

In [68]:
# how many states does the dataset contains?
data['state'].nunique()

31

In [69]:
# is there any same zip code, meaning any two store are close to each other?
data['zip'].nunique()
# yes there are some stores having the same zip codes

391

In [70]:
# are there any duplications on the store ID?
data['store'].nunique()
# no there isn't

452

In [72]:
# what are the states?
print(data['state'].unique())

['MO' 'AR' 'TX' 'AZ' 'CO' 'OK' 'NC' 'FL' 'GA' 'KS' 'KY' 'CA' 'IL' 'TN'
 'LA' 'MS' 'NM' 'UT' 'ID' 'MT' 'NJ' 'AL' 'IA' 'NE' 'NV' 'NY' 'OH' 'IN'
 'SC' 'VA' 'WY']

In [76]:
# what is the percentage breakdowns for each state 
print(data['state'].value_counts()/len(data))
# so TX is the most frequent state in the dataset, meaning we have the majority of stores located in TX

TX    0.174779
FL    0.103982
AR    0.059735
AZ    0.057522
OH    0.055310
NC    0.053097
LA    0.048673
MO    0.044248
TN    0.042035
GA    0.035398
OK    0.033186
KS    0.033186
KY    0.030973
CO    0.030973
AL    0.028761
VA    0.022124
CA    0.017699
SC    0.017699
MS    0.015487
UT    0.013274
NM    0.013274
IA    0.011062
NV    0.011062
NE    0.008850
MT    0.006637
NJ    0.006637
ID    0.006637
IL    0.006637
NY    0.004425
IN    0.004425
WY    0.002212
Name: state, dtype: float64

In [77]:
# what is the percentage breakdowns for each city
print(data['city'].value_counts()/len(data))
# we have the most stores in Little Rock

LITTLE ROCK             0.033186
OLATHE                  0.015487
GILBERT                 0.015487
SAN ANTONIO             0.015487
HOUSTON                 0.015487
                          ...
BILLINGS                0.002212
WEST DES MOINES         0.002212
AMARILLO                0.002212
LAKELAND                0.002212
CHEYENNE                0.002212
Name: city, Length: 298, dtype: float64

In [88]:
# we have 15 stores in Little Rock
(data['city']).value_counts().sort_values(ascending = False)

LITTLE ROCK             15
GILBERT                  7
SAN ANTONIO              7
HOUSTON                  7
OLATHE                   7
                        ..
MIDWEST CITY             1
LONGMONT                 1
SHAWNEE                  1
LAWTON                   1
CHEYENNE                 1
Name: city, Length: 298, dtype: int64